app/controllers/posts_controller.rb

	def index
		@new_post = Post.new
		@all_posts = Post.order(created_at: :desc).all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

	def create
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("name", "post", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["post", "one two three"], ["created_at", "2015-09-16 15:21:27.369525"], ["updated_at", "2015-09-16 15:21:27.369525"]]